homework2/app/controllers/movies_controller.rb

  def index
    if params[:ratings] != nil
      if params[:sort_by] == "date"
        @movies = Movie.find(:all, :order => "release_date",
            :conditions => { :rating => params[:ratings].keys })
      elsif params[:sort_by] == "title"
        @movies = Movie.find(:all, :order => "title",
            :conditions => { :rating => params[:ratings].keys })
      else
        @movies = Movie.all(:conditions =>
                  { :rating => params[:ratings].keys })
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R') ORDER BY release_date
SELECT "movies".* FROM "movies" ORDER BY release_date